full_load_test_results.txt
Получение токена аутентификации...
Токен получен
  PortfolioPro: полное нагрузочное тестирование
  Старт: Sat Apr 25 16:00:29 RTZ 2026

=== 1. Длительный тест (60 сек, c=20) GET /api/v1/projects ===
Running 60s test @ http://localhost:5000/api/v1/projects
20 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 1279 ms │ 1851 ms │ 2507 ms │ 2756 ms │ 1860.1 ms │ 314.52 ms │ 3073 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬───────┬───────┬─────────┬───────┬─────────┬────────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%     │ 97.5% │ Avg     │ Stdev  │ Min   │
├───────────┼───────┼───────┼─────────┼───────┼─────────┼────────┼───────┤
│ Req/Sec   │ 8     │ 8     │ 11      │ 12    │ 10,67   │ 0,79   │ 8     │
├───────────┼───────┼───────┼─────────┼───────┼─────────┼────────┼───────┤
│ Bytes/Sec │ 10 MB │ 10 MB │ 13.8 MB │ 15 MB │ 13.3 MB │ 987 kB │ 10 MB │
└───────────┴───────┴───────┴─────────┴───────┴─────────┴────────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 60

660 requests in 60.51s, 801 MB read

=== 2. Ступенчатое наращивание нагрузки (c=1,5,10,20,30,50) ===
-------- Тест с c=1 --------
Running 10s test @ http://localhost:5000/api/v1/projects
1 connections


┌─────────┬────────┬────────┬────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 101 ms │ 107 ms │ 131 ms │ 1320 ms │ 124.94 ms │ 134.68 ms │ 1320 ms │
└─────────┴────────┴────────┴────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬───────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg   │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼───────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 9       │ 10      │ 8     │ 2,87    │ 6       │
├───────────┼─────┼──────┼─────────┼─────────┼───────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 11.3 MB │ 12.5 MB │ 10 MB │ 3.58 MB │ 7.51 MB │
└───────────┴─────┴──────┴─────────┴─────────┴───────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

81 requests in 10.11s, 100 MB read
-------- Тест с c=5 --------
Running 10s test @ http://localhost:5000/api/v1/projects
5 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬───────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼───────────┼────────┤
│ Latency │ 224 ms │ 490 ms │ 751 ms │ 765 ms │ 492.57 ms │ 117.03 ms │ 859 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴───────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 9       │ 9       │ 10      │ 11      │ 10      │ 0,45   │ 9       │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 11.3 MB │ 11.3 MB │ 12.5 MB │ 13.8 MB │ 12.5 MB │ 561 kB │ 11.3 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

105 requests in 10.11s, 125 MB read
-------- Тест с c=10 --------
Running 10s test @ http://localhost:5000/api/v1/projects
10 connections


┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 309 ms │ 956 ms │ 1483 ms │ 1581 ms │ 927.06 ms │ 309.11 ms │ 1589 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 10      │ 10      │ 10      │ 11      │ 10,3    │ 0,46   │ 10      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 12.5 MB │ 12.5 MB │ 12.5 MB │ 13.8 MB │ 12.9 MB │ 574 kB │ 12.5 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

113 requests in 10.12s, 129 MB read
-------- Тест с c=20 --------
Running 10s test @ http://localhost:5000/api/v1/projects
20 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 718 ms │ 1925 ms │ 2703 ms │ 2706 ms │ 1843.29 ms │ 419.72 ms │ 2706 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 6       │ 6       │ 10      │ 11      │ 9,9     │ 1,38    │ 6       │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 7.51 MB │ 7.51 MB │ 12.5 MB │ 13.8 MB │ 12.4 MB │ 1.72 MB │ 7.51 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

119 requests in 10.13s, 124 MB read
-------- Тест с c=30 --------
Running 10s test @ http://localhost:5000/api/v1/projects
30 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1812 ms │ 3190 ms │ 4315 ms │ 4406 ms │ 3155.82 ms │ 584.19 ms │ 4406 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 9       │ 11      │ 8,1     │ 3,18    │ 5       │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 11.3 MB │ 13.8 MB │ 10.1 MB │ 3.98 MB │ 6.26 MB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

111 requests in 10.12s, 101 MB read
-------- Тест с c=50 --------
Running 10s test @ http://localhost:5000/api/v1/projects
50 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 3003 ms │ 5677 ms │ 8206 ms │ 8294 ms │ 5719.71 ms │ 1450.57 ms │ 8294 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬─────┬──────┬───────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50%   │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼─────┼──────┼───────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 8     │ 11      │ 6,4     │ 3,98    │ 2      │
├───────────┼─────┼──────┼───────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 10 MB │ 13.8 MB │ 8.01 MB │ 4.98 MB │ 2.5 MB │
└───────────┴─────┴──────┴───────┴─────────┴─────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

114 requests in 10.14s, 80.1 MB read

=== 3. Аналитика: разный объём навыков (c=10) ===
--- 3 навыка ---
Running 10s test @ http://localhost:5000/api/v1/analytics/recommend
10 connections


┌─────────┬────────┬────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 643 ms │ 711 ms │ 4987 ms │ 5641 ms │ 1232.75 ms │ 1432.15 ms │ 5641 ms │
└─────────┴────────┴────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 8       │ 20      │ 8       │ 7,33    │ 8       │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 5.65 kB │ 14.1 kB │ 5.65 kB │ 5.17 kB │ 5.65 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

90 requests in 10.15s, 56.5 kB read
--- 10 навыков ---
Running 10s test @ http://localhost:5000/api/v1/analytics/recommend
10 connections


┌─────────┬────────┬────────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 662 ms │ 725 ms │ 801 ms │ 801 ms │ 724.4 ms │ 69.49 ms │ 801 ms │
└─────────┴────────┴────────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 10      │ 10      │ 10      │ 20      │ 13,1    │ 4,53    │ 10      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 14.7 kB │ 14.7 kB │ 14.7 kB │ 29.4 kB │ 19.3 kB │ 6.66 kB │ 14.7 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

141 requests in 10.12s, 193 kB read
--- 20 навыков ---
Running 10s test @ http://localhost:5000/api/v1/analytics/recommend
10 connections


┌─────────┬──────┬──────┬───────┬───────┬─────────┬────────┬───────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%   │ Avg     │ Stdev  │ Max   │
├─────────┼──────┼──────┼───────┼───────┼─────────┼────────┼───────┤
│ Latency │ 2 ms │ 5 ms │ 8 ms  │ 10 ms │ 4.99 ms │ 1.6 ms │ 31 ms │
└─────────┴──────┴──────┴───────┴───────┴─────────┴────────┴───────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 1 506   │ 1 506   │ 1 836   │ 2 003   │ 1 813   │ 181,56 │ 1 506   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 2.15 MB │ 2.15 MB │ 2.63 MB │ 2.87 MB │ 2.59 MB │ 260 kB │ 2.15 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

0 2xx responses, 18130 non 2xx responses
18k requests in 10.04s, 25.9 MB read

=== 4. Смешанная нагрузка (5 проектов + 5 аналитика, 10 сек) ===
Запуск параллельных тестов...
--- Результат для GET /projects (5 соединений) ---
Running 10s test @ http://localhost:5000/api/v1/projects
5 connections


┌─────────┬────────┬────────┬────────┬─────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%     │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼─────────┼───────────┼──────────┼─────────┤
│ Latency │ 247 ms │ 621 ms │ 980 ms │ 1026 ms │ 620.98 ms │ 135.1 ms │ 1026 ms │
└─────────┴────────┴────────┴────────┴─────────┴───────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬───────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%   │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 6       │ 6       │ 8     │ 9       │ 7,9     │ 0,95    │ 6       │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 7.51 MB │ 7.51 MB │ 10 MB │ 11.3 MB │ 9.88 MB │ 1.18 MB │ 7.51 MB │
└───────────┴─────────┴─────────┴───────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

84 requests in 10.11s, 98.8 MB read
--- Результат для POST /analytics/recommend (5 соединений) ---
Running 10s test @ http://localhost:5000/api/v1/analytics/recommend
5 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 605 ms │ 628 ms │ 738 ms │ 739 ms │ 634.91 ms │ 30.91 ms │ 739 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 5       │ 5       │ 5       │ 10      │ 7,5    │ 2,5     │ 5       │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 3.53 kB │ 3.53 kB │ 3.53 kB │ 7.06 kB │ 5.3 kB │ 1.77 kB │ 3.53 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

80 requests in 10.12s, 53 kB read

  Тестирование завершено: Sat Apr 25 16:03:20 RTZ 2026
  Результаты сохранены в файл: full_load_test_results.txt